In [1]:
import pandas as pd
df = pd.read_csv("/content/drive/My Drive/Data /titanic.csv")
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [2]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'], axis = 1, inplace = True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [3]:
target = df.Survived
inputs = df.drop('Survived', axis = 1)

In [4]:
target.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [5]:
dummies = pd.get_dummies(inputs['Sex'])
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [6]:
inputs = pd.concat([inputs,dummies], axis = 1)
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [7]:
inputs.drop(['Sex'], axis = 1, inplace = True)
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [10]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [13]:
inputs.Age.head(10)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [14]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [15]:
inputs.head(10)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1
6       1  54.000000  51.8625       0     1
7       3   2.000000  21.0750       0     1
8       3  27.000000  11.1333       1     0
9       2  14.000000  30.0708       1     0

In [18]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs, target, test_size = 0.2)

In [19]:
 len(X_train)

712

In [20]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [21]:
model.fit(X_train, y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [22]:
model.score(X_test, y_test)

0.8268156424581006

In [23]:
X_test.head(10)

     Pclass        Age     Fare  female  male
683       3  14.000000  46.9000       0     1
824       3   2.000000  39.6875       0     1
99        2  34.000000  26.0000       0     1
727       3  29.699118   7.7375       1     0
733       2  23.000000  13.0000       0     1
48        3  29.699118  21.6792       0     1
220       3  16.000000   8.0500       0     1
151       1  22.000000  66.6000       1     0
843       3  34.500000   6.4375       0     1
170       1  61.000000  33.5000       0     1

In [25]:
y_test.head(10)

683    0
824    0
99     0
727    1
733    0
48     0
220    1
151    1
843    0
170    0
Name: Survived, dtype: int64

In [27]:
model.predict(X_test.head(10))

array([0, 0, 0, 1, 0, 0, 0, 1, 0, 0])

In [28]:
model.predict_proba(X_test.head(10))

array([[0.97205174, 0.02794826],
       [0.96292493, 0.03707507],
       [0.97149799, 0.02850201],
       [0.06402915, 0.93597085],
       [0.96772735, 0.03227265],
       [0.98516776, 0.01483224],
       [0.98046262, 0.01953738],
       [0.00407249, 0.99592751],
       [0.98593015, 0.01406985],
       [0.90153796, 0.09846204]])